# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/services"
tap "spicetify/tap"
tap "TheBoredTeam/boring-notch"

# CLI
brew "fastfetch"
brew "nmap"
brew "btop"
brew "cmatrix"
brew "ani-cli"
brew "git"
brew "spicetify-cli"
brew "neovim"
brew "docker"
brew "7zip"

# Apps
cask "visual-studio-code"
cask "vesktop"
cask "vlc"
cask "bambu-studio"
cask "waterfox"
cask "rekordbox"
cask "ghostty"
cask "spotify"
cask "boring-notch"
cask "aldente"
cask "blender"
cask "krita"

# Gaming
cask "prismlauncher"
cask "whisky"
cask "dolphin"
cask "steam"
brew "winetricks"