# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/services"
tap "spicetify/tap"
tap "iamchokerman/ani-cli"
tap "TheBoredTeam/boring-notch"

# CLI
brew "fastfetch"
brew "nmap"
brew "btop"
brew "cmatrix"
brew "ani-cli"
brew "git"
brew "spicetify-cli"
brew "neovim"
brew "7zip"
brew "winetricks"
brew "stow"

# Apps
cask "visual-studio-code"
cask "vesktop"
cask "iina"
cask "bambu-studio"
cask "waterfox"
cask "rekordbox"
cask "ghostty"
cask "spotify"
cask "boring-notch"
cask "aldente"
cask "blender"
cask "krita"
cask "utm"
cask "docker"
cask "autodesk-fusion"
cask "onyx"
cask "appcleaner"
cask "stats"
cask "alfred"
cask "obsidian"
cask "localsend"
cask "bartender"

# Gaming
cask "prismlauncher"
cask "whisky"
cask "dolphin"