# --- TAPS ---
tap "spicetify/tap"
tap "iamchokerman/ani-cli"
tap "TheBoredTeam/boring-notch"
tap "appleblox/homebrew-repo"

# --- TERMINAL & DEV TOOLS ---
brew "git"
brew "neovim"
brew "stow"           # Dotfile management
brew "7zip"
brew "nmap"
brew "btop"
brew "fastfetch"
brew "cmatrix"
brew "gh"
brew "jq"
brew "node"

# --- AI & VIRTUALIZATION ---
brew "ollama"         # Local LLM runner
cask "docker"         # Containers
cask "utm"            # Virtual Machines (Linux/Windows)

# --- DEVELOPMENT & CREATIVE ---
cask "visual-studio-code"
cask "ghostty"        # High-performance terminal
cask "blender"        # 3D Modeling
cask "autodesk-fusion" # CAD/CAM
cask "bambu-studio"   # 3D Printing
cask "krita"          # Digital Art

# --- PRIVACY & SYSTEM UTILITIES ---
cask "bitwarden"      # Password Manager
cask "protonvpn"      # Secure Networking
cask "aldente"        # Battery Longevity
cask "onyx"           # Deep System Maintenance
cask "appcleaner"     # Clean App Uninstalls
cask "stats"          # Hardware Monitoring
cask "alfred"         # Productivity Launcher

# --- INTERFACE & WORKFLOW ---
cask "ice"      # Menu Bar Management
cask "boring-notch"   # Notch Utility
cask "obsidian"       # Knowledge Base
cask "localsend"      # File Sharing
cask "waterfox"       # Privacy Browser
cask "transmission"   # Torrent Client
cask "rectangle"

# --- MEDIA & ENTERTAINMENT ---
cask "spotify"
brew "spicetify-cli"  # Spotify Customization
cask "vesktop"        # Discord Client
cask "iina"           # Modern Media Player
cask "rekordbox"      # DJing
brew "ani-cli"

# --- GAMING ---
cask "appleblox"
cask "prismlauncher"  # Minecraft
cask "whisky"         # Wine/Windows Gaming
cask "dolphin"        # GameCube/Wii Emulation
brew "winetricks"